[
    {
        "week": 0,
        "lab": "-",
        "projects": "Scratch",
        "language": "Scratch",
        "img": "./assets/week0.png",
        "description": "In this very first week there was an introduction to programming it self. To practic it we had to develpo a little prpogram in scratch. I coded a cool Bus driving game."
    },
    {
        "week": 1,
        "lab": "Population",
        "projects": "Hello, Mario (More), Credit",
        "language": "C",
        "img": "./assets/week1.png",
        "description": "In Mario (More), I had to code one of this Pyramides that Mario jumped over in the game, several times. While in Credit I coded a validation for creditcards, that outputs if a valid number is given, the credit card company to, like AMAX, Visa and MasterCard."
    },
    {
        "week": 2,
        "lab": "Scrabble",
        "projects": "Readability, Wordle",
        "language": "C",
        "img": "./assets/week2.png",
        "description": "In Scrable I coded a programm, that counted how much a word would scroe like in Scrable. And compared it to an other word. The programm redability takes a text and give you in which class level this Text would have been written from 0 to level 16+. Worle from CS50 is like the well gnown game where you have to guess a n letter word within n+1 guesses."
    },
    {
        "week": 3,
        "lab": "Sort",
        "projects": "Plurality, Tideman",
        "language": "C",
        "img": "./assets/week3.png",
        "description": "In the lab Sort I have to finde out which sorting Algorythem was used with the help of diverent sorted data Sets. Plurality was coded to simulates a plurality vote as same as Tideman simulates a Tideman vote."
    },
    {
        "week": 4,
        "lab": "Volume",
        "projects": "Filter (More), Recover",
        "language": "C",
        "img": "./assets/week4.png",
        "description": "In the lab Volume I coded a programm to increas or decrease the volume of a .wav file. In Filter (More) diferent kinde of filters can be applied to a given Picture. And Recover was coded to recover JPEGs from forensic images."
    },
    {
        "week": 5,
        "lab": "Inheritance",
        "projects": "Speller",
        "language": "C",
        "img": "./assets/week5.png",
        "description": "The lab Inheritance simulates the the blood types in a family tree. Speller takes a dictionary and look in a given text for all misspelled words and write them in a seperate file."
    },
    {
        "week": 6,
        "lab": "World Cup",
        "projects": "Sentimental / Hello, Sentimental / Mario (More), Sentimental / Credit, Sentimental / Readability, DNA",
        "language": "Python",
        "img": "./assets/week6.png",
        "description": "In this week a new language was introduced Python. With Python a bunch of privious coded programms was coded again, in a shorter time period than before. Additional the lab World Cup was coded an tested on different time of runs. While the accuracy increases the time of running the programm increases too. In DNA a programm was developed that identivys to whom a specific DNA belongs to."
    },
    {
        "week": 7,
        "lab": "Songs",
        "projects": "Movies, Fiftyville",
        "language": "SQL",
        "img": "#",
        "description": "..."
    },
    {
        "week": 8,
        "lab": "Trivia",
        "projects": "Homepage",
        "language": "HTML, CSS, Javascript, Bootstrap",
        "img": "#",
        "description": "..."
    }
]
